; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=35, out_folder=htg/blocksworld/training, instance_id=15, seed=2039, goal_proportion=0.1

(define (problem blocksworld-15)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 b32 b33 b34 b35 - object)
 (:init 
    (arm-empty)
    (clear b8)
    (on-table b8)
    (clear b2)
    (on b2 b13)
    (on b13 b29)
    (on-table b29)
    (clear b6)
    (on b6 b3)
    (on b3 b23)
    (on b23 b18)
    (on b18 b4)
    (on b4 b16)
    (on b16 b14)
    (on b14 b32)
    (on-table b32)
    (clear b12)
    (on b12 b28)
    (on-table b28)
    (clear b9)
    (on b9 b34)
    (on b34 b30)
    (on b30 b27)
    (on b27 b5)
    (on-table b5)
    (clear b31)
    (on b31 b7)
    (on b7 b22)
    (on b22 b15)
    (on b15 b33)
    (on-table b33)
    (clear b25)
    (on b25 b24)
    (on b24 b19)
    (on b19 b21)
    (on b21 b11)
    (on b11 b20)
    (on b20 b10)
    (on b10 b17)
    (on b17 b1)
    (on b1 b26)
    (on b26 b35)
    (on-table b35))
 (:goal  (and 
    (clear b3)
    (on-table b3)
    (clear b2)
    (on b2 b1)
    (on-table b1))))

; plan
1. (unstack b6 b3)
   deleted: (on b6 b3) (clear b6) (arm-empty)
   added: (holding b6) (clear b3)
   goals met: 2 of 5
2. (putdown b6)
   deleted: (holding b6)
   added: (clear b6) (arm-empty) (on-table b6)
   goals met: 2 of 5
3. (unstack b3 b23)
   deleted: (on b3 b23) (clear b3) (arm-empty)
   added: (holding b3) (clear b23)
   goals met: 1 of 5
4. (putdown b3)
   deleted: (holding b3)
   added: (clear b3) (arm-empty) (on-table b3)
   goals met: 3 of 5
5. (unstack b25 b24)
   deleted: (on b25 b24) (clear b25) (arm-empty)
   added: (holding b25) (clear b24)
   goals met: 3 of 5
6. (putdown b25)
   deleted: (holding b25)
   added: (clear b25) (arm-empty) (on-table b25)
   goals met: 3 of 5
7. (unstack b24 b19)
   deleted: (on b24 b19) (clear b24) (arm-empty)
   added: (holding b24) (clear b19)
   goals met: 3 of 5
8. (putdown b24)
   deleted: (holding b24)
   added: (clear b24) (arm-empty) (on-table b24)
   goals met: 3 of 5
9. (unstack b19 b21)
   deleted: (on b19 b21) (clear b19) (arm-empty)
   added: (holding b19) (clear b21)
   goals met: 3 of 5
10. (putdown b19)
   deleted: (holding b19)
   added: (clear b19) (arm-empty) (on-table b19)
   goals met: 3 of 5
11. (unstack b21 b11)
   deleted: (on b21 b11) (clear b21) (arm-empty)
   added: (holding b21) (clear b11)
   goals met: 3 of 5
12. (putdown b21)
   deleted: (holding b21)
   added: (clear b21) (arm-empty) (on-table b21)
   goals met: 3 of 5
13. (unstack b11 b20)
   deleted: (on b11 b20) (clear b11) (arm-empty)
   added: (holding b11) (clear b20)
   goals met: 3 of 5
14. (putdown b11)
   deleted: (holding b11)
   added: (clear b11) (arm-empty) (on-table b11)
   goals met: 3 of 5
15. (unstack b20 b10)
   deleted: (on b20 b10) (clear b20) (arm-empty)
   added: (holding b20) (clear b10)
   goals met: 3 of 5
16. (putdown b20)
   deleted: (holding b20)
   added: (clear b20) (arm-empty) (on-table b20)
   goals met: 3 of 5
17. (unstack b10 b17)
   deleted: (on b10 b17) (clear b10) (arm-empty)
   added: (holding b10) (clear b17)
   goals met: 3 of 5
18. (putdown b10)
   deleted: (holding b10)
   added: (clear b10) (arm-empty) (on-table b10)
   goals met: 3 of 5
19. (unstack b17 b1)
   deleted: (on b17 b1) (clear b17) (arm-empty)
   added: (holding b17) (clear b1)
   goals met: 3 of 5
20. (putdown b17)
   deleted: (holding b17)
   added: (clear b17) (arm-empty) (on-table b17)
   goals met: 3 of 5
21. (unstack b1 b26)
   deleted: (on b1 b26) (clear b1) (arm-empty)
   added: (holding b1) (clear b26)
   goals met: 3 of 5
22. (putdown b1)
   deleted: (holding b1)
   added: (clear b1) (arm-empty) (on-table b1)
   goals met: 4 of 5
23. (unstack b2 b13)
   deleted: (on b2 b13) (clear b2) (arm-empty)
   added: (holding b2) (clear b13)
   goals met: 3 of 5
24. (stack b2 b1)
   deleted: (clear b1) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b1)
   goals met: 5 of 5
